---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.RoomFailures
source: html/7bece7b1-6ad8-1153-a15a-5b16feabe08b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures

Failures about Room.

## Syntax (C#)
```csharp
public static class RoomFailures
```